webapp-osgeolive/src/main/webapp/static/examples/sos_v20/requests_soap/Transactional/InsertObservation_Measurement.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd">
  <env:Body>
    <sos:InsertObservation service="SOS" version="2.0.0" 
      xmlns:sos="http://www.opengis.net/sos/2.0"
      xmlns:swes="http://www.opengis.net/swes/2.0" 
      xmlns:swe="http://www.opengis.net/swe/2.0"
      xmlns:sml="http://www.opengis.net/sensorML/1.0.1" 
      xmlns:gml="http://www.opengis.net/gml/3.2"
      xmlns:xlink="http://www.w3.org/1999/xlink" 
      xmlns:om="http://www.opengis.net/om/2.0"
      xmlns:sams="http://www.opengis.net/samplingSpatial/2.0" 
      xmlns:sf="http://www.opengis.net/sampling/2.0"
      xsi:schemaLocation="http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd
                      http://www.opengis.net/samplingSpatial/2.0 http://schemas.opengis.net/samplingSpatial/2.0/spatialSamplingFeature.xsd">
      <!-- multiple offerings are possible -->
      <sos:offering>weather-data-muenster</sos:offering>
      <sos:observation>
        <om:OM_Observation gml:id="o1">
          <gml:description>test description for this observation</gml:description>
          <gml:identifier codeSpace="">osgeolive-observation-must-be-inserted-beforehand</gml:identifier>
          <om:type xlink:href="http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement"/>
          <om:phenomenonTime>
            <gml:TimeInstant gml:id="phenomenonTime">
              <gml:timePosition>2017-03-19T12:00:00.000+00:00</gml:timePosition>
            </gml:TimeInstant>
          </om:phenomenonTime>
          <om:resultTime xlink:href="#phenomenonTime"/>
          <om:procedure xlink:href="52NorthWS1"/>
          <om:observedProperty xlink:href="Temperature"/>
          <om:featureOfInterest xlink:href="52NorthWS1" />
          <om:result xsi:type="gml:MeasureType" uom="Cel">0.28</om:result>
        </om:OM_Observation>
      </sos:observation>
    </sos:InsertObservation>
  </env:Body>
</env:Envelope>
